package com.yiqi.watcher.base.dota2;

import lombok.Getter;
import lombok.ToString;

/**
 * @author Wang Hongyu
 * @title: Common
 * @projectName watcher-robot
 * @description: dota2枚举类
 * @date 2120/10/27
 */
@Getter
@ToString
public enum Common {
    Dota2;
    // 单排
    private String[] WIN_NEGATIVE_SOLO = {
            " 牛啊，这么演都能赢？,",
            " 可真有你的，躺着都能赢。",
            " 啧啧啧，打团都没来, 队友4V5赢得了比赛。"
    };
    private String[] WIN_POSTIVE_SOLO = {
            " 打法凶狠 操作细腻 经验丰富 意识到位是我见过最牛的Dota2玩家。",
            " 暴打对面后赢得了胜利，这么牛，开黑怎么看不到？",
            " 把对面当猪宰了, 牛啊。",
            " 又赢了, 这游戏就是这么枯燥, 且乏味。"
    };
    private String[] LOSE_NEGATIVE_SOLO = {
            " 真有你的啊，被人按在地上打",
            " 可真有你的，捕鱼被鱼吃了, 打的是个几把。",
            " 头都被打歪了, 心态爆炸地输掉了比赛",
    };
    private String[] LOSE_POSTIVE_SOLO = {
            " 整蛊队友还是有一套啊!",
            " 老演员了，背靠世界树, 致敬同福",
            " 又输了, 很难受, 宁愿输的是我。"
    };
    // 组排
    private String[] WIN_NEGATIVE_PARTY = {
            " 别说了，又苟了一把，真有他的。",
            " 牛啊，这么演都能赢？,",
            " 可真有你的，躺着都能赢。",
            " 啧啧啧，打团都没来, 队友4V5赢得了比赛。"
    };
    private String[] WIN_POSTIVE_PARTY = {
            " 打法凶狠 操作细腻 经验丰富 意识到位是我见过最牛的Dota2玩家。",
            " 把对面当猪宰了, 牛啊。",
            " 又赢了, 这游戏就是这么枯燥, 且乏味。"
    };
    private String[] LOSE_NEGATIVE_PARTY = {
            " 真有你的啊，被人按在地上打",
            " 可真有你的，捕鱼被鱼吃了, 打的是个几把。",
            " 头都被打歪了, 心态爆炸地输掉了比赛",
    };
    private String[] LOSE_POSTIVE_PARTY = {
            "整蛊队友还是有一套啊!",
            "老演员了，背靠世界树, 致敬同福",
            "又输了, 很难受, 宁愿输的是我。"
    };
    // 游戏模式
    private String[] GAME_MODE = {
            "No Game Mode",
            "全英雄选择",
            "队长模式",
            "随机征召",
            "小黑屋",
            "全部随机",
            "万圣节活动",
            "反队长模式",
            "贪魔活动",
            "教程",
            "中路模式",
            "生疏模式",
            "新手模式",
            "Compendium Matchmaking",
            "自定义游戏",
            "队长征召",
            "平衡征召",
            "OMG",
            "活动模式",
            "全英雄死亡随机",
            "中路SOLO",
            "全英雄选择",
            "加速模式"
    };
    // 匹配类型
    private String[] LOBBY = {
            "非法ID",
            "普通匹配",
            "练习",
            "锦标赛",
            "教程",
            "合作对抗电脑",
            "组排模式",
            "单排模式",
            "天梯匹配",
            "中路SOLO"
    };
    // 服务器ID列表
    private String[] AREA_CODE;
    //英雄昵称
    private String[] HEROES_LIST_CHINESE = {
            "敌法师",
            "斧王",
            "痛苦之源",
            "血魔",
            "水晶室女",
            "卓尔游侠",
            "撼地者",
            "主宰",
            "米拉娜",
            "变体精灵",
            "影魔",
            "幻影长矛手",
            "帕克",
            "帕吉",
            "剃刀",
            "沙王",
            "风暴之灵",
            "斯温",
            "小小",
            "复仇之魂",
            "风行者",
            "宙斯",
            "昆卡",
            "未知",
            "莉娜",
            "莱恩",
            "暗影萨满",
            "斯拉达",
            "潮汐猎人",
            "巫医",
            "巫妖",
            "力丸",
            "谜团",
            "修补匠",
            "狙击手",
            "瘟疫法师",
            "术士",
            "兽王",
            "痛苦女王",
            "剧毒术士",
            "虚空假面",
            "冥魂大帝",
            "死亡先知",
            "幻影刺客",
            "帕格纳",
            "圣堂刺客",
            "冥界亚龙",
            "露娜",
            "龙骑士",
            "戴泽",
            "发条技师",
            "拉席克",
            "先知",
            "噬魂鬼",
            "黑暗贤者",
            "克林克兹",
            "全能骑士",
            "魅惑魔女",
            "哈斯卡",
            "暗夜魔王",
            "育母蜘蛛",
            "赏金猎人",
            "编织者",
            "双头龙",
            "蝙蝠骑士",
            "陈",
            "幽鬼",
            "远古冰魂",
            "末日使者",
            "熊战士",
            "裂魂人",
            "矮人直升机",
            "炼金术士",
            "祈求者",
            "沉默术士",
            "殁境神蚀者",
            "狼人",
            "兽王",
            "暗影恶魔",
            "德鲁伊",
            "混沌骑士",
            "米波",
            "树精卫士",
            "食人魔魔法师",
            "不朽尸王",
            "拉比克",
            "萨尔",
            "司夜刺客",
            "娜迦海妖",
            "光之守卫",
            "艾欧",
            "维萨吉",
            "斯拉克",
            "美杜莎",
            "巨馍战将",
            "半人马行者",
            "马格纳斯",
            "伐木机",
            "钢背兽",
            "巨牙海民",
            "天怒法师",
            "亚巴顿",
            "上古巨神",
            "军团指挥官",
            "工程师",
            "灰烬之灵",
            "大地之灵",
            "孽主",
            "恐怖利刃",
            "凤凰",
            "神谕者",
            "寒冬飞龙",
            "天穹守望者",
            "齐天大圣",
            "邪影芳灵",
            "石鳞剑士",
            "天涯墨客",
            "虚无之灵",
            "电炎绝手",
            "玛尔斯"
    };
}
